Revit 2027 API
TaskDialog.WasExtraCheckBoxChecked Method
 Gets the status of the extra checkbox.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool WasExtraCheckBoxChecked()
Public Function WasExtraCheckBoxChecked As Boolean
public:
bool WasExtraCheckBoxChecked()
member WasExtraCheckBoxChecked : unit -> bool
Return Value
Boolean
 Whether the extra checkbox is checked.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the task dialog does not have an extra checkbox or the task dialog is not shown yet.
See Also
Reference
TaskDialog Class
Autodesk.Revit.UI Namespace